# Есть список a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89].
# Выведите все элементы, которые меньше 5.
def func1 (a):
    return list(filter( lambda elem: elem > 5, a ))


# Даны списки:
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];
# b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13].
# Нужно вернуть список, который состоит из элементов, общих для этих двух списков.

def func2(a, b):
    return list(filter(lambda elem: elem in b , a))

# Отсортируйте словарь по значению в порядке возрастания и убывания.

def func3(a):
    return 

def main():
    #print(func1([1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]))
    print(func2([1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89],[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]))
    pass


if __name__ == '__main__':
  main()
